app/controllers/actus_controller.rb

INSERT INTO "actus" ("updated_at", "title", "newsletter_id", "description", "created_at") VALUES('2008-12-15 18:51:19', 'ueoaaueo', NULL, 'euoueaouaeo', '2008-12-15 18:51:19')
---
  def create
    @actu = Actu.new(params[:actu])
    respond_to do |format|
      if @actu.save

DELETE FROM "actus" WHERE "id" = 2
---
  def destroy
    @actu.destroy