app/controllers/newsletters_controller.rb

  def show
    @newsletter = Newsletter.find(params[:id])
---
SELECT * FROM "newsletters" WHERE ("newsletters"."id" = 1)

  def edit
    @newsletter = Newsletter.find(params[:id])
---
SELECT * FROM "newsletters" WHERE ("newsletters"."id" = 1)

  def create
    @newsletter = Newsletter.new(params[:newsletter])

    respond_to do |format|
      if @newsletter.save
---
INSERT INTO "newsletters" ("name", "updated_at", "artist_name", "party_description", "party_name", "artist_photo_content_type", "party_cost", "artist_caption", "party_adress", "artist_photo_file_name", "artist_photo_file_size", "created_at") VALUES('eoua', '2008-12-12 21:04:35', 'aeoueoeuao', 'euoueoueoa', 'euoauaeo', NULL, 'euueo', 'ueoueoue', 'euoueoeuao', NULL, NULL, '2008-12-12 21:04:35')

  def update
    @newsletter = Newsletter.find(params[:id])

    respond_to do |format|
      if @newsletter.update_attributes(params[:newsletter])
---
SELECT * FROM "newsletters" WHERE ("newsletters"."id" = 1)
UPDATE "newsletters" SET "artist_photo_content_type" = 'image/png', "artist_photo_file_size" = 6229, "artist_photo_file_name" = 'Image 1.png', "updated_at" = '2008-12-12 19:46:13' WHERE "id" = 1