app/controllers/parties_controller.rb

  def index
    @parties = Party.find_all_by_newsletter_id(params[:newsletter_id])
---
SELECT * FROM "parties" WHERE ("parties"."newsletter_id" = '1')

  def show
    @party = Party.find(params[:id])
---
SELECT * FROM "parties" WHERE ("parties"."id" = 1)

  def edit
    @party = Party.find(params[:id])
---
SELECT * FROM "parties" WHERE ("parties"."id" = 1)

  def create
    @party = Party.new(params[:party])

    respond_to do |format|
      if @party.save
---
INSERT INTO "parties" ("name", "updated_at", "focus", "newsletter_id", "day", "created_at") VALUES('Abdou party!!!', '2008-12-15 17:46:54', NULL, NULL, '2008-12-15', '2008-12-15 17:46:54')

  def update
    @party = Party.find(params[:id])
---
SELECT * FROM "parties" WHERE ("parties"."id" = 1)